/* eslint-disable no-unused-vars */

export type TReagent = "Синклотидовая кислота" | "Ретропин" | "Флекситаин" | "Кетопирид" | "Алосетазон" | "Асеназон" | "Формальдегид" | "Политриеновая кислота" | "Уксус" | "Гуманизин" | "Арахнизин" | "Дионизин" | "Дварфизин" | "Унатхизин" | "Аденозин" | "Адезин­трифосфат" | "Резоциллин" | "Трайвонин" | "Диловен" | "Этилредоксразин" | "Криптобиолин" | "Аритразин" | "Бикаридин" | "Криоксадон" | "Доксарубиксадон" | "Эпинефрин" | "Дермалин" | "Дексалин" | "Дексалин плюс" | "Хироналин" | "Инапровалин" | "Ипекак" | "Транексамовая кислота" | "Келотан" | "Лепоразин" | "Фалангимин" | "Амбузол" | "Амбузол плюс" | "Синаптизин" | "Трикордразин" | "Токсин хартбрейкер" | "Импедризин" | "Лексорин" | "Липозин" | "Токсин майндбрейкер" | "Космические наркотики" | "Ультраваскулин" | "Окулин" | "Сидерлак" | "Когнизин" | "Сигинат" | "Физраствор" | "Напалм" | "Флогистон" | "CLF3" | "EZ-нутриенты" | "Робаст харвест" | "Left-4-zed" | "Plant-B-gone" | "Аммиак" | "Диэтиламин" | "Фенол" | "Ацетон" | "Пенообразующий агент" | "Политриновая кислота" | "Серная кислота" | "Фторсерная кислота" | "Столовая соль" | "Термит" | "Нестабильный мутаген" | "Масло" | "Фторсурфактант" | "Дезоксиэфедрин" | "Эфедрин" | "Токсин немоты" | "Хлоральгидрат" | "Пакс" | "Уголь" | "Норэпинефриновая кислота" | "Этилоксиэфедрин" | "Дифенилметиламин" | "Карбонат натрия"
export type TRecipe = {[reagent: string]: number}


export interface IChemist {
    type?: string | TReagent,
    id: string,
    impact?: string,
    minTemp?: number,
    priority?: number,
    reactants: {
        [reactant: string]: {
            amount: number
        }
    },
    products: {
        [products: string]: number
    },
    [SomeElseMethods: string]: unknown
}